//GUESSJCL JOB 1,NOTIFY=&SYSUID
//COBRUN EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..SOURCE(GUESSCBL),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(GUESSCBL),DISP=SHR
