//HELLOJCL    JOB 1,NOTIFY=&SYSUID
//HELLOIGY   EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..SOURCE(HELLOCBL),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(HELLOCBL),DISP=SHR
// IF RC = 0 THEN
//HELLORUN EXEC PGM=HELLOCBL
//STEPLIB    DD DSN=&SYSUID..LOAD,DISP=SHR
//SOMECBL    DD DSN=&SYSUID..SOURCE(SOMECBL),DISP=SHR
//SYSOUT     DD SYSOUT=*
//CEEDUMP    DD DUMMY
//SYSUDUMP   DD DUMMY
// ELSE
// ENDIF
